Autodesk.Navisworks.Api.Schema.SchemaData
Contains data values defined by a given schema definition. May be traversed manually or accessed via NET DLR dynamic typing.

Autodesk.Navisworks.Api.Schema.SchemaData.Copy
Creates a copy of the current state of this data object.
Throws System.InvalidOperationException:
C++ exception 'LcUSchemaInvalidException' thrown
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Schema.SchemaData.Definition
Schema definition that defines this data object.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Schema.SchemaData.Autodesk#Navisworks#Api#IHasDynamicProperties#DynamicMemberNames
Enumerates the dynamically added members of the object by name.

Autodesk.Navisworks.Api.Schema.SchemaData.EditAccessor
Accessor for editing values when beginning a query into this data object.
Throws System.InvalidOperationException:
C++ exception 'LcUSchemaInvalidException' thrown
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Schema.SchemaData.System#Dynamic#IDynamicMetaObjectProvider#GetMetaObject(System.Linq.Expressions.Expression)


Autodesk.Navisworks.Api.Schema.SchemaData.Autodesk#Navisworks#Api#IHasDynamicProperties#GetProperty(System.String)
Fetches the property value specified by the string argument.
name:
Name of the dynamic property to obtain. As with real NET properties, this name is case-sensitive.
Returns:
Value of the dynamic property retrieved.
Throws System.ArgumentException: Name is not a valid dynamic property.

Autodesk.Navisworks.Api.Schema.SchemaData.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.Schema.SchemaData.ReadAccessor
Read-only accessor for beginning a query into this data object.
Throws System.InvalidOperationException:
C++ exception 'LcUSchemaInvalidException' thrown
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Schema.SchemaData.Autodesk#Navisworks#Api#IHasDynamicProperties#SetProperty(System.String,System.Object)
Sets a value to the property specified by the string argument.
name:
Name of the dynamic property to set. As with real NET properties, this name is case-sensitive.
value:
Value to set. This should match the type of the dynamic property.
Returns:
The same object as was passed to argument 'value'. This enables settor chaining.
Throws System.ArgumentException: Name is not a valid dynamic property.
Throws System.InvalidCastException: Value does not cast to the expected dynamic property type.
Throws System.NotSupportedException: Setting to the property is not supported.

Autodesk.Navisworks.Api.Schema.SchemaData.ValueCompares(Autodesk.Navisworks.Api.Schema.SchemaData)
Performs a value comparison.
Throws System.InvalidOperationException:
C++ exception 'LcUSchemaInvalidException' thrown
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'rhs' is null
Throws System.ArgumentException:
Argument 'rhs' has been Disposed

Autodesk.Navisworks.Api.Schema.SchemaData.ValueEquals(Autodesk.Navisworks.Api.Schema.SchemaData)
Performs comparison 'By Value'

Autodesk.Navisworks.Api.Schema.SchemaData.ValueEquals(Autodesk.Navisworks.Api.Schema.SchemaData,Autodesk.Navisworks.Api.Schema.SchemaData)
Compares the two references 'By Value'